index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-02 Tue 12:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Get down, Markdown</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Adolfo Antón Bravo" />
<meta name="description" content="Notas sobre el lenguaje de marcado Markdown"
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Get down, Markdown</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga08742f">Markdown</a></li>
<li><a href="#orgab81d87">Fácil de leer&#x2026; y sobre todo de escribir</a></li>
<li><a href="#orga99221e">Sintaxis fácil</a></li>
<li><a href="#orgfb9525f">Escribe una vez, publica cuantas quieras</a></li>
<li><a href="#org778f4e2">Inspiración</a></li>
<li><a href="#org14cd6f8">Nombre</a></li>
<li><a href="#org92c266a">HTML</a></li>
<li><a href="#org99629cf">Tipos de elementos HTML</a></li>
<li><a href="#orgce2d894">Escape automático para elementos especiales</a></li>
<li><a href="#org7f57577">Escape incluso en URLs</a></li>
<li><a href="#org2d04085">Compatibilidad</a></li>
<li><a href="#org741e6b9">Párrafos y nuevas líneas</a></li>
<li><a href="#orge30e074">Sintaxis</a></li>
<li><a href="#orgeab42de">Encabezados</a></li>
<li><a href="#orge15556b">H1</a></li>
<li><a href="#org5a05a67">H2</a></li>
<li><a href="#org6793666">H3, H4, H5, H6</a></li>
<li><a href="#org662bb49">Nota</a></li>
<li><a href="#orga5efc42">Énfasis</a></li>
<li><a href="#orgaa0ae5a">Enlace</a></li>
<li><a href="#orgb0b54ea">Enlace Markdown</a></li>
<li><a href="#orgc229a5a">Enlace con marcas</a></li>
<li><a href="#orgc74c0c1">Enlaces de referencia o citas</a></li>
<li><a href="#orgfb142f8">Bloques de cita</a></li>
<li><a href="#org6a4c7c9">Licencia</a></li>
<li><a href="#orgad4480e">Disponibilidad</a></li>
<li><a href="#org6aaf8cd">Bibliografía</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga08742f" class="outline-2">
<h2 id="orga08742f">Markdown</h2>
<div class="outline-text-2" id="text-orga08742f">
<p>
Markdown se trata de dos cosas a la vez.
</p>

<ul class="org-ul">
<li>Lenguaje de marcado ligero para la Web sin la complejidad de HTML.</li>
<li>Software que convierte el texto escrito en Markdown en HTML.</li>
</ul>
</div>
</div>
<div id="outline-container-orgab81d87" class="outline-2">
<h2 id="orgab81d87">Fácil de leer&#x2026; y sobre todo de escribir</h2>
<div class="outline-text-2" id="text-orgab81d87">
<ul class="org-ul">
<li>Busca ser fácil de escribir</li>
<li>Pero sobre todo <b>fácil de leer</b></li>
</ul>
</div>
</div>

<div id="outline-container-orga99221e" class="outline-2">
<h2 id="orga99221e">Sintaxis fácil</h2>
<div class="outline-text-2" id="text-orga99221e">
<ul class="org-ul">
<li>La sintaxis elegida indica lo que significa</li>
<li>Por ejemplo, los asteriscos para enfatizar una palabra o frase</li>
<li>Por ejemplo, los puntos para mostrar listados.</li>
</ul>

<blockquote>
<p>
Gruber confiesa que no creó Markdown para escribir de forma más fácil HTML porque ya le parecía muy fácil, sino que lo que quería era leerlo mejor.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgfb9525f" class="outline-2">
<h2 id="orgfb9525f">Escribe una vez, publica cuantas quieras</h2>
<div class="outline-text-2" id="text-orgfb9525f">
<ul class="org-ul">
<li>Si el <i>HTML</i> es el lenguaje para publicar documentos Web</li>
<li><i>Markdown</i> es un lenguaje para escribir y leer documentos.</li>
</ul>
</div>
</div>

<div id="outline-container-org778f4e2" class="outline-2">
<h2 id="org778f4e2">Inspiración</h2>
<div class="outline-text-2" id="text-org778f4e2">
<p>
Se inspira en muchos conversores de texto a HTML como:
</p>
<ul class="org-ul">
<li><a href="http://docutils.sourceforge.net/mirror/setext.html">Setext</a></li>
<li><a href="http://www.aaronsw.com/2002/atx/intro">atx</a></li>
<li><a href="https://txstyle.org/">Textile</a></li>
<li><a href="http://docutils.sourceforge.net/rst.html">Rest</a></li>
<li><a href="http://triptico.com/software/grutatxt.html">Grutatext</a></li>
<li>EtText</li>
<li>Pero sobre todo en las convenciones existentes para marcar mensajes de correo electrónico usando texto plano.</li>
</ul>
</div>
</div>

<div id="outline-container-org14cd6f8" class="outline-2">
<h2 id="org14cd6f8">Nombre</h2>
<div class="outline-text-2" id="text-org14cd6f8">
<p>
El nombre juega con el Markup de HTML, el lenguaje de marcado de hipertexto
</p>

<ul class="org-ul">
<li>Markup, marcas de HTML</li>
<li>Markdown, documentos simples</li>
</ul>
</div>
</div>

<div id="outline-container-org92c266a" class="outline-2">
<h2 id="org92c266a">HTML</h2>
<div class="outline-text-2" id="text-org92c266a">
<ul class="org-ul">
<li>Allí donde la sintaxis de Markdown no llega se puede emplear HTML tal cual.</li>
<li>No hay que señalarlo de ninguna manera pero sí que se debe dejar una línea en blanco antes o después de <code>&lt;div&gt;</code>, <code>&lt;table&gt;</code>, <code>&lt;pre&gt;</code>, <code>&lt;p&gt;</code>, etc.</li>
<li>No se puede usar Markdown dentro de los citados elementos de bloque HTML, o al menos no con el resultado esperado.</li>
<li>Pero sí que se puede usar elementos en línea de HTML en un párrafo escrito en Markdown.</li>
</ul>
</div>
</div>

<div id="outline-container-org99629cf" class="outline-2">
<h2 id="org99629cf">Tipos de elementos HTML</h2>
<div class="outline-text-2" id="text-org99629cf">
<p>
Hay dos tipos fundamentales de elementos HTML, elementos de bloque y elementos en línea.
</p>
<ul class="org-ul">
<li>Los elementos en bloque son aquellos que forman un bloque de texto, como un párrafo, y son <code>div</code>, <code>table</code>, <code>p</code>, <code>pre</code>, <code>ul</code>, <code>li</code>, etc.</li>
<li>Mientras que los elementos en línea se sitúan dentro de los elementos de bloque, como son los enlaces <code>a</code>, las palabras señaladas <code>strong</code> o enfatizadas <code>em</code>, <code>span</code>, <code>cite</code>, <code>del</code>, etc.</li>
</ul>
</div>
</div>
<div id="outline-container-orgce2d894" class="outline-2">
<h2 id="orgce2d894">Escape automático para elementos especiales</h2>
<div class="outline-text-2" id="text-orgce2d894">
<p>
En HTML hay dos caracteres que requieren tratarse especialmente:
</p>
<ul class="org-ul">
<li><code>&lt;</code>: se utilizan para iniciar etiquetas</li>
<li><code>&amp;</code>: denotan entidades HTML.</li>
</ul>

<p>
Si quieres usarlos, debes ponerlos como entidades, <code>&amp;lt;</code> y <code>&amp;amp;</code>
</p>
</div>
</div>

<div id="outline-container-org7f57577" class="outline-2">
<h2 id="org7f57577">Escape incluso en URLs</h2>
<div class="outline-text-2" id="text-org7f57577">
<p>
Debes incluso escapar <i>et</i> que aparezcan en el interior de direcciones URL. Por ejemplo, esta dirección:
</p>

<div class="org-src-container">
<pre class="src src-html">http://images.google.com/images?num=30<span style="color: #DFAF8F;">&amp;q</span>=grace+hooper
</pre>
</div>

<p>
Hay que codificarla como:
</p>
<div class="org-src-container">
<pre class="src src-html">http://images.google.com/images?num=30<span style="color: #DFAF8F;">&amp;amp;</span>q=grace+hooper

</pre>
</div>

<p>
Esto es algo que se olvida con facilidad y es el error más frecuente en los servicios de validación del marcado de sitios web.
</p>

<p>
Cualquier <i>et</i> que corresponda con una entidad HTML, permanecerá tal cual pero si se escribe sin ser parte de una entidad o sin la entidad <i>et</i> en sí, se traducirá como <code>&amp;amp;</code>, y lo mismo con <code>&lt;</code>, que no lo traducirá si se pertenece a un elemento de HTML pero sí si está en una expresión tipo <code>4 &lt; 5</code>, por lo que aparecería como <code>4 &amp;lt; 5</code>
</p>
</div>
</div>
<div id="outline-container-org2d04085" class="outline-2">
<h2 id="org2d04085">Compatibilidad</h2>
<div class="outline-text-2" id="text-org2d04085">
<ul class="org-ul">
<li>Markdown fue implementado originariamente en Perl por Tom Gruber</li>
<li>Se ha sido traducido a multitud de lenguajes de programación, incluyendo PHP, Python, Ruby, Java y Common Lisp.</li>
</ul>
</div>
</div>

<div id="outline-container-org741e6b9" class="outline-2">
<h2 id="org741e6b9">Párrafos y nuevas líneas</h2>
<div class="outline-text-2" id="text-org741e6b9">
<ul class="org-ul">
<li>Son elementos de bloque en Markdown</li>
<li>Un párrafo es una o más líneas de texto separadas por una o más líneas de blanco.</li>
<li>No por muchas líneas de separación que pongamos vamos a conseguir más separación entre párrafos, es decir, no traduce cada línea de separación por una etiqueta <code>&lt;br /&gt;</code></li>
</ul>
</div>
</div>
<div id="outline-container-orge30e074" class="outline-2">
<h2 id="orge30e074">Sintaxis</h2>
<div class="outline-text-2" id="text-orge30e074">
<ul class="org-ul">
<li>Encabezados</li>
<li>Énfasis</li>
<li>Enlaces</li>
</ul>
</div>
</div>

<div id="outline-container-orgeab42de" class="outline-2">
<h2 id="orgeab42de">Encabezados</h2>
<div class="outline-text-2" id="text-orgeab42de">
<ul class="org-ul">
<li>H1</li>
<li>H2</li>
<li>Hn</li>
</ul>
</div>
</div>

<div id="outline-container-orge15556b" class="outline-2">
<h2 id="orge15556b">H1</h2>
<div class="outline-text-2" id="text-orge15556b">
<p>
Para el encabezamiento principal podemos utilizar dos sintaxis:
</p>
<pre class="example" id="org12fe741">
Esto es un H1
=============

# Esto es un H1

</pre>
</div>
</div>

<div id="outline-container-org5a05a67" class="outline-2">
<h2 id="org5a05a67">H2</h2>
<div class="outline-text-2" id="text-org5a05a67">
<p>
Para el H2 podemos utilizar dos formas también:
</p>

<pre class="example" id="org8aa94df">
Esto es un H2
-------------

## Esto es un H2
</pre>
</div>
</div>

<div id="outline-container-org6793666" class="outline-2">
<h2 id="org6793666">H3, H4, H5, H6</h2>
<div class="outline-text-2" id="text-org6793666">
<p>
Podemos continuar escribiendo almohadillas, según el número de ellas que escribamos, el número de <code>H</code> que sea:
</p>
<pre class="example" id="orgfec0ebd">
### Esto es un H3
#### Esto es un H4
##### Esto es un H5
</pre>
</div>
</div>
<div id="outline-container-org662bb49" class="outline-2">
<h2 id="org662bb49">Nota</h2>
<div class="outline-text-2" id="text-org662bb49">
<ul class="org-ul">
<li>Tanto para <code>=</code> como para <code>-</code> no es importante que sean el mismo número de caracteres que de la línea que precede.</li>
<li>Cuando eliges almohadillas, puedes poner a continuación del texto almohadillas, aunque no sirven de nada, puede ser útil.</li>
<li>Es decir, no tiene importancia el número de almohadillas que pongas al final.</li>
</ul>

<pre class="example" id="org3fd98ce">
## Esto es un H2 ###
</pre>
</div>
</div>


<div id="outline-container-orga5efc42" class="outline-2">
<h2 id="orga5efc42">Énfasis</h2>
<div class="outline-text-2" id="text-orga5efc42">
<p>
Se puede hacer de dos formas, con itálicas o negritas.
</p>
<ul class="org-ul">
<li>Para las <i>itálicas</i>, lo circunscribimos entre asteriscos o guiones bajos simples.</li>
<li>Para las <b>negritas</b>, lo rodearemos de guiones dobles o guiones bajos dobles:</li>
<li>Para <b>negritas</b> e <i>itálicas</i>, todo junto, lo pondremos entre tres asteriscos:</li>
</ul>
<pre class="example" id="org1476dda">
*italic*   **bold**
_italic_   __bold__
***cursiva y negrita***
</pre>
</div>
</div>

<div id="outline-container-orgaa0ae5a" class="outline-2">
<h2 id="orgaa0ae5a">Enlace</h2>
<div class="outline-text-2" id="text-orgaa0ae5a">
<p>
Puedes escribirlo de tres maneras distintas:
</p>
<ol class="org-ol">
<li>Enlace Markdown</li>
<li>Enlace con marcas</li>
<li>Enlaces con referencia o citas</li>
</ol>
</div>
</div>
<div id="outline-container-orgb0b54ea" class="outline-2">
<h2 id="orgb0b54ea">Enlace Markdown</h2>
<div class="outline-text-2" id="text-orgb0b54ea">
<pre class="example" id="org2e0ce9d">
Un [ejemplo](http://blog.infotics.es/ "Title")
</pre>
<p>
Donde <code>Title</code> es el atributo <code>title</code> de HTML
</p>
</div>
</div>
<div id="outline-container-orgc229a5a" class="outline-2">
<h2 id="orgc229a5a">Enlace con marcas</h2>
<div class="outline-text-2" id="text-orgc229a5a">
<pre class="example" id="org0eea930">
&lt;http://blog.infotics.es&gt;
Escribe a:
&lt;hola@infotics.es&gt;
</pre>
</div>
</div>

<div id="outline-container-orgc74c0c1" class="outline-2">
<h2 id="orgc74c0c1">Enlaces de referencia o citas</h2>
<div class="outline-text-2" id="text-orgc74c0c1">
<pre class="example" id="orga17409b">
[URL de enlace uno][1] debajo de este párrafo, aparecerá debajo el enlace uno, y a continuación [el enlace dos][2].

[1]: http://url
[2]: http://otra.url "Con atributo title aquí dentro"

</pre>

<p>
Que también se pueden hacer con un atajo:
</p>
<pre class="example" id="org4355d22">
Quiero que esta referencia sea un [atajo][] que aparece a continuación del párrafo.

[atajo]: http://la.url.que.quiero
</pre>
</div>
</div>

<div id="outline-container-orgfb142f8" class="outline-2">
<h2 id="orgfb142f8">Bloques de cita</h2>
<div class="outline-text-2" id="text-orgfb142f8">
<p>
Usamos el carácter <code>&gt;</code> para cada línea de texto que queremos 
</p>

<p>
Por ejemplo:
</p>
<pre class="example" id="orgc8ca1c6">
&gt; Esto es una cita
&gt; Dime de qué careces
&gt; Y te diré de qué presumes

</pre>
</div>
</div>
<div id="outline-container-org6a4c7c9" class="outline-2">
<h2 id="org6a4c7c9">Licencia</h2>
<div class="outline-text-2" id="text-org6a4c7c9">
<ul class="org-ul">
<li>Fue creado originalmente por John Gruber y Aaron Swartz para la Web</li>
<li>Se distribuye bajo licencia BSD</li>
</ul>
</div>
</div>
<div id="outline-container-orgad4480e" class="outline-2">
<h2 id="orgad4480e">Disponibilidad</h2>
<div class="outline-text-2" id="text-orgad4480e">
<p>
Está disponible como plugin en diferentes sistemas de gestión de contenidos (CMS)
</p>
</div>
</div>
<div id="outline-container-org6aaf8cd" class="outline-2">
<h2 id="org6aaf8cd">Bibliografía</h2>
<div class="outline-text-2" id="text-org6aaf8cd">
<p>
<a href="http://greg.schueler.us/doc/markdown.txt">http://greg.schueler.us/doc/markdown.txt</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-07-16 Sat 01:30</p>
<p class="author">Author: Adolfo Antón Bravo</p>
<p class="date">Created: 2021-11-02 Tue 12:30</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
